AchimPieters/ESP32-bathroom-fan/main/main.c
/**
   Copyright 2026 Achim Pieters | StudioPieters®

   Permission is hereby granted, free of charge, to any person obtaining a copy
   of this software and associated documentation files (the "Software"), to deal
   in the Software without restriction, including without limitation the rights
   to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
   copies of the Software, and to permit persons to whom the Software is
   furnished to do so, subject to the following conditions:

   The above copyright notice and this permission notice shall be included in all
   copies or substantial portions of the Software.

   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
   IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
   FITNESS FOR A PARTICULAR PURPOSE AND NON INFRINGEMENT. IN NO EVENT SHALL THE
   AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,
   WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

   for more information visit https://www.studiopieters.nl
   Professional Bathroom Ventilation Controller
 **/

 #include <math.h>
 #include <stdbool.h>
 #include <stdio.h>
 #include <stdlib.h>
 #include <time.h>
 #include <sys/time.h>

 #include <driver/gpio.h>
 #include <driver/i2c.h>
 #include <esp_err.h>
 #include <esp_log.h>
 #include <esp_mac.h>
 #include <esp_rom_sys.h>
 #include <esp_system.h>
 #include <esp_netif_sntp.h>
 #include <freertos/FreeRTOS.h>
 #include <freertos/semphr.h>
 #include <freertos/task.h>
 #include <homekit/characteristics.h>
 #include <homekit/homekit.h>
 #include <nvs.h>

 #include <button.h>
 #include <sht3x.h>

 #include "esp32-lcm.h"

// ==================================================
// GPIO CONFIGURATION
// ==================================================

 #define LED_GPIO CONFIG_ESP_LED_GPIO
 #define BUTTON_GPIO CONFIG_ESP_BUTTON_GPIO

 #define FAN_LOW_GPIO CONFIG_ESP_FAN_LOW_GPIO
 #define FAN_MED_GPIO CONFIG_ESP_FAN_MED_GPIO
 #define FAN_HIGH_GPIO CONFIG_ESP_FAN_HIGH_GPIO

// ==================================================
// I2C CONFIGURATION
// ==================================================

 #define I2C_MASTER_PORT I2C_NUM_0
 #define I2C_MASTER_SCL CONFIG_I2C_MASTER_SCL
 #define I2C_MASTER_SDA CONFIG_I2C_MASTER_SDA
 #define SHT3X_ADDR CONFIG_SHT3X_I2C_ADDRESS

// After this many consecutive failed reads (~10s at the 2s retry interval)
// assume the bus is wedged rather than just momentarily noisy, and attempt
// recovery. Recovery itself is rate-limited so a persistently dead/absent
// sensor doesn't spam bus resets forever.
 #define SHT3X_FAILS_BEFORE_RECOVERY 5
 #define SHT3X_RECOVERY_BACKOFF_MS 30000

static const char *TAG_MAIN = "MAIN";
static const char *TAG_SENSOR = "SENSOR";

static esp_err_t i2c_master_init(void) {
        i2c_config_t conf = {
                .mode = I2C_MODE_MASTER,
                .sda_io_num = I2C_MASTER_SDA,
                .scl_io_num = I2C_MASTER_SCL,
                .sda_pullup_en = GPIO_PULLUP_ENABLE,
                .scl_pullup_en = GPIO_PULLUP_ENABLE,
                .master.clk_speed = 100000,
        };

        ESP_ERROR_CHECK(i2c_param_config(I2C_MASTER_PORT, &conf));
        return i2c_driver_install(I2C_MASTER_PORT, conf.mode, 0, 0, 0);
}

// A wedged I2C bus (SHT3x left mid-transaction by an abrupt reset, or a
// noise glitch) shows up as SDA permanently held low. Bit-bang up to 9 SCL
// pulses to let the slave finish/release the line, then issue a STOP
// condition before handing the bus back to the driver.
static void i2c_bus_recover(void) {
        ESP_LOGW(TAG_SENSOR, "Attempting I2C bus recovery (SDA=%d SCL=%d)",
                 I2C_MASTER_SDA, I2C_MASTER_SCL);

        i2c_driver_delete(I2C_MASTER_PORT);

        gpio_set_direction(I2C_MASTER_SCL, GPIO_MODE_OUTPUT_OD);
        gpio_set_direction(I2C_MASTER_SDA, GPIO_MODE_INPUT);
        gpio_set_pull_mode(I2C_MASTER_SCL, GPIO_PULLUP_ONLY);
        gpio_set_pull_mode(I2C_MASTER_SDA, GPIO_PULLUP_ONLY);
        gpio_set_level(I2C_MASTER_SCL, 1);

        for (int i = 0; i < 9 && gpio_get_level(I2C_MASTER_SDA) == 0; i++) {
                gpio_set_level(I2C_MASTER_SCL, 0);
                esp_rom_delay_us(5);
                gpio_set_level(I2C_MASTER_SCL, 1);
                esp_rom_delay_us(5);
        }

        // Manual STOP condition: SDA low-to-high while SCL is high.
        gpio_set_direction(I2C_MASTER_SDA, GPIO_MODE_OUTPUT_OD);
        gpio_set_level(I2C_MASTER_SDA, 0);
        esp_rom_delay_us(5);
        gpio_set_level(I2C_MASTER_SCL, 1);
        esp_rom_delay_us(5);
        gpio_set_level(I2C_MASTER_SDA, 1);
        esp_rom_delay_us(5);

        esp_err_t err = i2c_master_init();
        if (err != ESP_OK) {
                ESP_LOGE(TAG_SENSOR, "I2C re-install after recovery failed: %s", esp_err_to_name(err));
        }
}

// I2C "General Call Reset" (address 0x00, data byte 0x06). The SHT3x
// documents this alongside its dedicated soft-reset command, and unlike the
// dedicated command it doesn't require the sensor to already be listening
// for its own address — some wedged states ACK the general call when they
// won't ACK anything else. Failure here is not fatal on its own; it's only
// ever used as an extra kick before re-issuing the real soft reset.
static esp_err_t i2c_general_call_reset(void) {
        i2c_cmd_handle_t cmd = i2c_cmd_link_create();
        i2c_master_start(cmd);
        i2c_master_write_byte(cmd, 0x00, true);
        i2c_master_write_byte(cmd, 0x06, true);
        i2c_master_stop(cmd);
        esp_err_t err = i2c_master_cmd_begin(I2C_MASTER_PORT, cmd, pdMS_TO_TICKS(100));
        i2c_cmd_link_delete(cmd);
        return err;
}

// Full recovery cycle for a sensor that stopped responding: free a
// potentially wedged bus (bit-banged clock pulses + STOP), try the broadcast
// general-call reset, then the SHT3x's own soft-reset command. Returns
// ESP_OK only once the sensor has actually ACKed the soft reset — if that
// still fails after this sequence, the fault is almost certainly inside the
// sensor's own analog/digital core rather than on the bus, which per
// Sensirion's datasheet only a real VDD power-on-reset is guaranteed to
// clear (no I2C command can force that).
static esp_err_t sht3x_recover_and_reinit(void) {
        i2c_bus_recover();

