AchimPieters/ESP32-bathroom-fan/main/main.c
        esp_err_t gc_err = i2c_general_call_reset();
        if (gc_err != ESP_OK) {
                ESP_LOGD(TAG_SENSOR, "I2C general call reset not ACKed: %s", esp_err_to_name(gc_err));
        }

        return sht3x_init(SHT3X_ADDR);
}

// ==================================================
// QUIET-FIRST HUMIDITY CONTROL PARAMETERS
// ==================================================

 #define HUM_OFF 58.0f
 #define HUM_LOW_ON 60.0f
 #define HUM_MID_ON 70.0f
 #define HUM_HIGH_ON 80.0f
 #define HUM_EMERGENCY 85.0f

 #define HUM_RISE_MID 10.0f
 #define HUM_RISE_HIGH 18.0f

 #define SHOWER_MIN_HUM 55.0f
 #define SHOWER_TEMP_RISE_HUM 5.0f

 #define TEMP_ON 30.0f
 #define TEMP_MID_ON 32.0f
 #define TEMP_OFF 28.0f

 #define MIN_RUNTIME_MIN 10
 #define MANUAL_TIMEOUT_MIN 20

 #define EMA_ALPHA 0.2f

// ==================================================
// SENSOR CALIBRATION
// ==================================================

 #define TEMP_OFFSET 0.8f
 #define HUM_OFFSET -10.0f

// ==================================================
// NIGHT QUIET MODE
// ==================================================

 #define NIGHT_START_HOUR 22
 #define NIGHT_END_HOUR 7

 #define NIGHT_MAX_MODE FAN_LOW

// ==================================================
// HOMEKIT SAFE NOTIFY LIMITS
// ==================================================

 #define TEMP_NOTIFY_DELTA 0.2f
 #define HUM_NOTIFY_DELTA 0.5f

 #define TEMP_MIN_NOTIFY_MS 30000
 #define HUM_MIN_NOTIFY_MS_NORMAL 15000
 #define HUM_MIN_NOTIFY_MS_SPIKE 5000

 #define MAX_EVENTS_PER_MIN_NORMAL 20
 #define MAX_EVENTS_PER_MIN_SPIKE 35

 #define HUM_SPIKE_LEVEL 70.0f

// ==================================================
// STATE
// ==================================================

typedef enum {
        FAN_OFF = 0,
        FAN_LOW,
        FAN_MID,
        FAN_HIGH,
} fan_mode_t;

static fan_mode_t fan_mode = FAN_OFF;

// Serialises access to the shared fan/control state between the HomeKit
// setter callbacks and the sensor task. Created in app_main() before either
// can run. fan_set() assumes the caller already holds this mutex.
static SemaphoreHandle_t state_mutex = NULL;

static float ema_temp = 0;
static float ema_hum = 0;
static float baseline_humidity = 0;

static bool ema_initialized = false;
static bool baseline_initialized = false;

static float last_notified_temp = 0;
static float last_notified_hum = 0;

static TickType_t last_temp_notify = 0;
static TickType_t last_hum_notify = 0;

static TickType_t minute_window_start = 0;
static uint32_t events_this_minute = 0;

static bool auto_mode = true;
static TickType_t fan_started_at = 0;
static TickType_t manual_started_at = 0;

static bool hk_fan_on = false;
static float hk_speed = 0;

static bool sntp_started = false;

// ==================================================
// HOMEKIT CHARACTERISTICS
// ==================================================

static homekit_value_t fan_on_get(void);
static void fan_on_set(homekit_value_t value);
static homekit_value_t fan_speed_get(void);
static void fan_speed_set(homekit_value_t value);

homekit_characteristic_t fan_on_characteristic =
        HOMEKIT_CHARACTERISTIC_(ON, false, .getter = fan_on_get, .setter = fan_on_set);

homekit_characteristic_t fan_speed_characteristic =
        HOMEKIT_CHARACTERISTIC_(ROTATION_SPEED, 0, .getter = fan_speed_get, .setter = fan_speed_set);

homekit_characteristic_t temperature_characteristic =
        HOMEKIT_CHARACTERISTIC_(CURRENT_TEMPERATURE, 0);

homekit_characteristic_t humidity_characteristic =
        HOMEKIT_CHARACTERISTIC_(CURRENT_RELATIVE_HUMIDITY, 0);

homekit_characteristic_t name = HOMEKIT_CHARACTERISTIC_(NAME, "Bathroom Fan");
homekit_characteristic_t manufacturer = HOMEKIT_CHARACTERISTIC_(MANUFACTURER, "StudioPieters®");
homekit_characteristic_t serial = HOMEKIT_CHARACTERISTIC_(SERIAL_NUMBER, "R1TFL8J965HE");
homekit_characteristic_t model = HOMEKIT_CHARACTERISTIC_(MODEL, "TY3V0LC/Q");
homekit_characteristic_t revision =
        HOMEKIT_CHARACTERISTIC_(FIRMWARE_REVISION, LIFECYCLE_DEFAULT_FW_VERSION);
homekit_characteristic_t ota_trigger = API_OTA_TRIGGER;

// ==================================================
// TIME / SNTP
// ==================================================

static void time_sync_start(void) {
        if (sntp_started) {
                return;
        }

        setenv("TZ", "CET-1CEST,M3.5.0/2,M10.5.0/3", 1);
        tzset();

        esp_sntp_config_t config = ESP_NETIF_SNTP_DEFAULT_CONFIG("pool.ntp.org");
        esp_err_t err = esp_netif_sntp_init(&config);

        if (err == ESP_OK || err == ESP_ERR_INVALID_STATE) {
                sntp_started = true;
                ESP_LOGI(TAG_MAIN, "SNTP started");
        } else {
                ESP_LOGW(TAG_MAIN, "SNTP start failed: %s", esp_err_to_name(err));
        }
}

static bool is_night_time(void) {
        time_t now = 0;
        struct tm timeinfo = {0};

        time(&now);

        if (now < 1700000000) {
                return false;
        }

        localtime_r(&now, &timeinfo);

        int hour = timeinfo.tm_hour;

        if (NIGHT_START_HOUR > NIGHT_END_HOUR) {
                return hour >= NIGHT_START_HOUR || hour < NIGHT_END_HOUR;
        }

        return hour >= NIGHT_START_HOUR && hour < NIGHT_END_HOUR;
}

// ==================================================
// FAN CONTROL
// ==================================================

static void pulse(gpio_num_t pin) {
        gpio_set_level(pin, 0);
        vTaskDelay(pdMS_TO_TICKS(150));
        gpio_set_level(pin, 1);
}

// Caller must hold state_mutex.
static void fan_set(fan_mode_t mode) {
        if (fan_mode == mode) {
                return;
        }

        // Track the start of every OFF -> running transition (manual or auto)
        // so the minimum-runtime guarantee uses a correct reference.
        if (fan_mode == FAN_OFF && mode != FAN_OFF) {
                fan_started_at = xTaskGetTickCount();
        }

        fan_mode = mode;

        switch (mode) {
        case FAN_OFF:
                pulse(FAN_LOW_GPIO);
                hk_fan_on = false;
                hk_speed = 0;
                break;

