AchimPieters/ESP32-bathroom-fan/main/main.c
        case FAN_LOW:
                pulse(FAN_LOW_GPIO);
                hk_fan_on = true;
                hk_speed = 30;
                break;

        case FAN_MID:
                pulse(FAN_MED_GPIO);
                hk_fan_on = true;
                hk_speed = 60;
                break;

        case FAN_HIGH:
                pulse(FAN_HIGH_GPIO);
                hk_fan_on = true;
                hk_speed = 100;
                break;
        }

        fan_on_characteristic.value = HOMEKIT_BOOL(hk_fan_on);
        fan_speed_characteristic.value = HOMEKIT_FLOAT(hk_speed);

        homekit_characteristic_notify(&fan_on_characteristic, fan_on_characteristic.value);
        homekit_characteristic_notify(&fan_speed_characteristic, fan_speed_characteristic.value);
}

// ==================================================
// IDENTIFY LED
// ==================================================

void accessory_identify(homekit_value_t value) {
        (void)value;

        for (int i = 0; i < 3; i++) {
                gpio_set_level(LED_GPIO, 1);
                vTaskDelay(pdMS_TO_TICKS(150));
                gpio_set_level(LED_GPIO, 0);
                vTaskDelay(pdMS_TO_TICKS(150));
        }
}

// ==================================================
// BUTTON CALLBACK
// ==================================================

void button_callback(button_event_t event, void *context) {
        (void)context;

        switch (event) {
        case button_event_single_press:
                lifecycle_request_update_and_reboot();
                break;

        case button_event_double_press:
                homekit_server_reset();
                esp_restart();
                break;

        case button_event_long_press:
                lifecycle_factory_reset_and_reboot();
                break;

        default:
                break;
        }
}

// ==================================================
// SAFE HOMEKIT NOTIFY
// ==================================================

// Returns true when the notification was actually sent, false when it was
// dropped by the rate limiter. Callers should only advance their
// "last notified value" when this returns true.
static bool safe_notify(homekit_characteristic_t *ch,
                        homekit_value_t value,
                        TickType_t *last_tick,
                        uint32_t min_interval_ms,
                        uint32_t max_events_per_min) {
        TickType_t now = xTaskGetTickCount();

        if ((now - minute_window_start) > pdMS_TO_TICKS(60000)) {
                minute_window_start = now;
                events_this_minute = 0;
        }

        if (events_this_minute >= max_events_per_min) {
                return false;
        }

        if ((now - *last_tick) < pdMS_TO_TICKS(min_interval_ms)) {
                return false;
        }

        homekit_characteristic_notify(ch, value);

        *last_tick = now;
        events_this_minute++;
        return true;
}

// ==================================================
// HOMEKIT FAN
// ==================================================

static homekit_value_t fan_on_get(void) {
        return HOMEKIT_BOOL(hk_fan_on);
}

static void fan_on_set(homekit_value_t value) {
        if (value.format != homekit_format_bool) {
                return;
        }

        xSemaphoreTake(state_mutex, portMAX_DELAY);

        hk_fan_on = value.bool_value;
        auto_mode = false;
        manual_started_at = xTaskGetTickCount();

        if (!hk_fan_on) {
                fan_set(FAN_OFF);
                xSemaphoreGive(state_mutex);
                return;
        }

        if (hk_speed <= 0) {
                hk_speed = 30;
        }

        if (hk_speed < 40) {
                fan_set(FAN_LOW);
        } else if (hk_speed < 80) {
                fan_set(FAN_MID);
        } else {
                fan_set(FAN_HIGH);
        }

        xSemaphoreGive(state_mutex);
}

static homekit_value_t fan_speed_get(void) {
        return HOMEKIT_FLOAT(hk_speed);
}

static void fan_speed_set(homekit_value_t value) {
        if (value.format != homekit_format_float && value.format != homekit_format_int) {
                return;
        }

        xSemaphoreTake(state_mutex, portMAX_DELAY);

        hk_speed = (value.format == homekit_format_float) ? value.float_value : (float)value.int_value;
        auto_mode = false;
        manual_started_at = xTaskGetTickCount();

        if (hk_speed <= 0) {
                fan_set(FAN_OFF);
        } else if (hk_speed < 40) {
                fan_set(FAN_LOW);
        } else if (hk_speed < 80) {
                fan_set(FAN_MID);
        } else {
                fan_set(FAN_HIGH);
        }

        xSemaphoreGive(state_mutex);
}

// ==================================================
// SENSOR TASK
// ==================================================

static void sensor_task(void *arg) {
        (void)arg;

        uint32_t consecutive_failures = 0;
        TickType_t last_recovery_attempt = 0;

        while (1) {
                float t = 0;
                float h = 0;

                if (sht3x_read_temperature_humidity(SHT3X_ADDR, &t, &h) == ESP_OK) {
                        consecutive_failures = 0;

                        t += TEMP_OFFSET;
                        h += HUM_OFFSET;

                        if (h < 0.0f) {
                                h = 0.0f;
                        }

                        if (h > 100.0f) {
                                h = 100.0f;
                        }

                        if (!ema_initialized) {
                                ema_temp = t;
                                ema_hum = h;
                                ema_initialized = true;
                        } else {
                                ema_temp = EMA_ALPHA * t + (1 - EMA_ALPHA) * ema_temp;
                                ema_hum = EMA_ALPHA * h + (1 - EMA_ALPHA) * ema_hum;
                        }

                        if (fan_mode == FAN_OFF) {
                                if (!baseline_initialized) {
                                        baseline_humidity = ema_hum;
                                        baseline_initialized = true;
                                } else {
                                        baseline_humidity = baseline_humidity * 0.98f + ema_hum * 0.02f;
                                }
                        }

                        float rise = ema_hum - baseline_humidity;

