AchimPieters/ESP32-bathroom-fan/main/main.c
                        bool spike_mode = (ema_hum >= HUM_SPIKE_LEVEL) || (rise >= HUM_RISE_MID);

                        uint32_t max_epm = spike_mode ? MAX_EVENTS_PER_MIN_SPIKE : MAX_EVENTS_PER_MIN_NORMAL;
                        uint32_t hum_interval = spike_mode ? HUM_MIN_NOTIFY_MS_SPIKE : HUM_MIN_NOTIFY_MS_NORMAL;

                        bool night_mode = is_night_time();
                        bool emergency = ema_hum >= HUM_EMERGENCY;

                        xSemaphoreTake(state_mutex, portMAX_DELAY);

                        // Emergency humidity always engages automatic control, even
                        // while a manual override is active, so the fan can clear a
                        // dangerously humid room.
                        if (auto_mode || emergency) {
                                fan_mode_t target_mode = FAN_OFF;

                                bool temp_low = ema_temp >= TEMP_ON;
                                bool temp_mid = ema_temp >= TEMP_MID_ON;

                                bool shower_detected =
                                        (rise >= HUM_RISE_MID && ema_hum >= SHOWER_MIN_HUM) ||
                                        (ema_temp >= TEMP_ON && rise >= SHOWER_TEMP_RISE_HUM) ||
                                        (ema_hum >= HUM_MID_ON);

                                bool high_needed = emergency || ema_hum >= HUM_HIGH_ON || rise >= HUM_RISE_HIGH;
                                bool mid_needed = shower_detected || temp_mid;
                                bool low_needed = ema_hum >= HUM_LOW_ON || temp_low;

                                if (high_needed) {
                                        target_mode = FAN_HIGH;
                                } else if (mid_needed) {
                                        target_mode = FAN_MID;
                                } else if (low_needed) {
                                        target_mode = FAN_LOW;
                                } else {
                                        target_mode = FAN_OFF;
                                }

                                if (night_mode && !emergency && target_mode > NIGHT_MAX_MODE) {
                                        target_mode = NIGHT_MAX_MODE;
                                }

                                uint32_t runtime =
                                        (xTaskGetTickCount() - fan_started_at) / pdMS_TO_TICKS(60000);

                                if (fan_mode != FAN_OFF && target_mode == FAN_OFF && runtime < MIN_RUNTIME_MIN) {
                                        target_mode = FAN_LOW;
                                }

                                if (fan_mode != FAN_OFF &&
                                    runtime >= MIN_RUNTIME_MIN &&
                                    ema_hum < HUM_OFF &&
                                    ema_temp < TEMP_OFF) {
                                        target_mode = FAN_OFF;
                                }

                                if (target_mode != fan_mode) {
                                        fan_set(target_mode);
                                }

                                ESP_LOGI(TAG_SENSOR,
                                         "Control: Shower=%d Emergency=%d Low=%d Mid=%d High=%d Target=%d",
                                         shower_detected,
                                         emergency,
                                         low_needed,
                                         mid_needed,
                                         high_needed,
                                         target_mode);
                        } else {
                                uint32_t manual_runtime =
                                        (xTaskGetTickCount() - manual_started_at) / pdMS_TO_TICKS(60000);

                                if (manual_runtime > MANUAL_TIMEOUT_MIN) {
                                        auto_mode = true;
                                }
                        }

                        xSemaphoreGive(state_mutex);

                        if (fabsf(ema_temp - last_notified_temp) > TEMP_NOTIFY_DELTA) {
                                temperature_characteristic.value = HOMEKIT_FLOAT(ema_temp);
                                if (safe_notify(&temperature_characteristic,
                                                temperature_characteristic.value,
                                                &last_temp_notify,
                                                TEMP_MIN_NOTIFY_MS,
                                                max_epm)) {
                                        last_notified_temp = ema_temp;
                                }
                        }

                        if (fabsf(ema_hum - last_notified_hum) > HUM_NOTIFY_DELTA) {
                                humidity_characteristic.value = HOMEKIT_FLOAT(ema_hum);
                                if (safe_notify(&humidity_characteristic,
                                                humidity_characteristic.value,
                                                &last_hum_notify,
                                                hum_interval,
                                                max_epm)) {
                                        last_notified_hum = ema_hum;
                                }
                        }

                        ESP_LOGI(TAG_SENSOR,
                                 "Temp=%.2fC Hum=%.2f%% Baseline=%.2f%% Rise=%.2f%% Auto=%d Mode=%d Night=%d",
                                 ema_temp,
                                 ema_hum,
                                 baseline_humidity,
                                 rise,
                                 auto_mode,
                                 fan_mode,
                                 night_mode);

                        vTaskDelay(pdMS_TO_TICKS(spike_mode ? 3000 : 10000));
                } else {
                        consecutive_failures++;
                        ESP_LOGW(TAG_SENSOR, "SHT3X read failed (%u in a row), retrying in 2s",
                                 (unsigned)consecutive_failures);

                        TickType_t now = xTaskGetTickCount();
                        bool backoff_elapsed =
                                (now - last_recovery_attempt) > pdMS_TO_TICKS(SHT3X_RECOVERY_BACKOFF_MS);

                        if (consecutive_failures >= SHT3X_FAILS_BEFORE_RECOVERY && backoff_elapsed) {
                                last_recovery_attempt = now;

                                esp_err_t reinit_err = sht3x_recover_and_reinit();
                                if (reinit_err == ESP_OK) {
                                        ESP_LOGI(TAG_SENSOR, "SHT3X recovered after I2C bus reset");
                                        consecutive_failures = 0;
                                } else {
                                        ESP_LOGE(TAG_SENSOR,
                                                 "SHT3X still not responding after bus recovery + general-call "
                                                 "reset (%s). This points to the sensor's own internal state, "
                                                 "not the bus — Sensirion's SHT3x has no I2C command that "
                                                 "guarantees recovery from that; only removing and reapplying "
                                                 "its VDD does. Will keep retrying every %ds in case it clears "
                                                 "on its own.",
                                                 esp_err_to_name(reinit_err),
                                                 SHT3X_RECOVERY_BACKOFF_MS / 1000);
                                }
                        }

                        vTaskDelay(pdMS_TO_TICKS(2000));
                }
        }
}

// ==================================================
// HOMEKIT ACCESSORY CONFIGURATION
// ==================================================

 #pragma GCC diagnostic push
 #pragma GCC diagnostic ignored "-Woverride-init"

homekit_accessory_t *accessories[] = {
        HOMEKIT_ACCESSORY(.id = 1,
                          .category = homekit_accessory_category_fan,
                          .services =
                                  (homekit_service_t *[]) {
                HOMEKIT_SERVICE(ACCESSORY_INFORMATION,
                                .characteristics =
                                        (homekit_characteristic_t *[]) {
                        &name,
                        &manufacturer,
                        &serial,
                        &model,
                        &revision,
                        HOMEKIT_CHARACTERISTIC(IDENTIFY,
                                               accessory_identify),
                        NULL,
                }),

                HOMEKIT_SERVICE(FAN,
                                .primary = true,
                                .characteristics =
                                        (homekit_characteristic_t *[]) {
                        HOMEKIT_CHARACTERISTIC(NAME,
                                               "Bathroom Fan"),
                        &fan_on_characteristic,
                        &fan_speed_characteristic,
                        &ota_trigger,
                        NULL,
                }),

