AchimPieters/ESP32-bathroom-fan/main/main.c
                HOMEKIT_SERVICE(TEMPERATURE_SENSOR,
                                .characteristics =
                                        (homekit_characteristic_t *[]) {
                        HOMEKIT_CHARACTERISTIC(NAME,
                                               "Bathroom Temperature"),
                        &temperature_characteristic,
                        NULL,
                }),

                HOMEKIT_SERVICE(HUMIDITY_SENSOR,
                                .characteristics =
                                        (homekit_characteristic_t *[]) {
                        HOMEKIT_CHARACTERISTIC(
                                NAME,
                                "Bathroom Humidity"),
                        &humidity_characteristic,
                        NULL,
                }),

                NULL,
        }),
        NULL,
};

 #pragma GCC diagnostic pop

homekit_server_config_t config = {
        .accessories = accessories,
        .password = CONFIG_ESP_SETUP_CODE,
        .setupId = CONFIG_ESP_SETUP_ID,
};

static void on_wifi_ready(void) {
        static bool homekit_started = false;

        time_sync_start();

        if (homekit_started) {
                return;
        }

        homekit_server_init(&config);
        homekit_started = true;
}

// ==================================================
// MAIN
// ==================================================

void app_main(void) {
        state_mutex = xSemaphoreCreateMutex();
        if (state_mutex == NULL) {
                ESP_LOGE(TAG_MAIN, "Failed to create state mutex");
                abort();
        }

        ESP_ERROR_CHECK(lifecycle_nvs_init());
        lifecycle_log_post_reset_state(TAG_MAIN);
        ESP_ERROR_CHECK(lifecycle_configure_homekit(&revision, &ota_trigger, TAG_MAIN));

        // Derive a per-device serial number from the factory MAC so that
        // multiple units don't share an identity in the same HomeKit home.
        static char serial_number[18];
        uint8_t mac[6] = {0};
        if (esp_read_mac(mac, ESP_MAC_WIFI_STA) == ESP_OK) {
                snprintf(serial_number, sizeof(serial_number),
                         "SP-%02X%02X%02X%02X%02X%02X",
                         mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
                serial.value.string_value = serial_number;
                serial.value.is_static = true;
        }

        gpio_reset_pin(LED_GPIO);
        gpio_set_direction(LED_GPIO, GPIO_MODE_OUTPUT);
        gpio_set_level(LED_GPIO, 0);

        gpio_reset_pin(FAN_LOW_GPIO);
        gpio_set_direction(FAN_LOW_GPIO, GPIO_MODE_OUTPUT_OD);
        gpio_set_level(FAN_LOW_GPIO, 1);

        gpio_reset_pin(FAN_MED_GPIO);
        gpio_set_direction(FAN_MED_GPIO, GPIO_MODE_OUTPUT_OD);
        gpio_set_level(FAN_MED_GPIO, 1);

        gpio_reset_pin(FAN_HIGH_GPIO);
        gpio_set_direction(FAN_HIGH_GPIO, GPIO_MODE_OUTPUT_OD);
        gpio_set_level(FAN_HIGH_GPIO, 1);

        gpio_reset_pin(BUTTON_GPIO);
        gpio_set_direction(BUTTON_GPIO, GPIO_MODE_INPUT);
        gpio_set_pull_mode(BUTTON_GPIO, GPIO_PULLUP_ONLY);

        button_config_t btn_cfg = {
                .active_level         = button_active_low,
                .long_press_time      = 2000,
                .repeat_press_timeout = 400,
                .max_repeat_presses   = 3,
        };

        if (button_create(BUTTON_GPIO, btn_cfg, button_callback, NULL)) {
                ESP_LOGE(TAG_MAIN, "Button init failed");
        } else {
                ESP_LOGI(TAG_MAIN,
                         "Button initialized on GPIO%d as active-low with internal pull-up",
                         BUTTON_GPIO);
        }

        ESP_ERROR_CHECK(i2c_master_init());

        // A plain reboot (button, HomeKit "reset", the Eve app's firmware-update
        // toggle, a watchdog reset, ...) power-cycles the ESP32 but NOT the
        // SHT3x's own VDD rail, so a sensor left mid-transaction by the previous
        // run can still be wedged when this code runs. Retrying the bare
        // soft-reset command alone can't fix that — it only talks to a sensor
        // that's already listening. Fall back to the full bus-recovery sequence
        // (bit-banged clock pulses + general call reset) before giving up.
        esp_err_t sht_err = sht3x_init(SHT3X_ADDR);
        if (sht_err != ESP_OK) {
                ESP_LOGW(TAG_MAIN, "SHT3x not responding at boot (%s); attempting bus recovery",
                         esp_err_to_name(sht_err));
                for (int i = 0; i < 3 && sht_err != ESP_OK; i++) {
                        vTaskDelay(pdMS_TO_TICKS(50));
                        sht_err = sht3x_recover_and_reinit();
                }
        }
        if (sht_err != ESP_OK) {
                ESP_LOGE(TAG_MAIN,
                         "SHT3x still not responding after bus recovery (%s) — sensor readings "
                         "unavailable until the sensor's own retry loop succeeds or it is power-cycled",
                         esp_err_to_name(sht_err));
        }

        xTaskCreate(sensor_task, "sensor", 4096, NULL, 5, NULL);

        esp_err_t wifi_err = wifi_start(on_wifi_ready);
        if (wifi_err == ESP_ERR_NVS_NOT_FOUND) {
                ESP_LOGW(TAG_MAIN, "WiFi provisioning data missing");
        } else if (wifi_err != ESP_OK) {
                ESP_LOGE(TAG_MAIN, "wifi_start failed: %s", esp_err_to_name(wifi_err));
        }
}
